{"data":{"site":{"siteMetadata":{"title":"Rants & Ramblings","author":"Wilbur Suero"}},"markdownRemark":{"id":"bd2037e8-87d5-51d9-8c24-aead162fe2e6","excerpt":"I am always looking for ways to make me a better developer. This not only includes coding and programming skills, but also improving  the process of coding and…","html":"<p>I am always looking for ways to make me a better developer. This not only includes coding and programming skills, but also improving  the process of coding and automating and streamlining my ways around these processes. One area I have vastly improved is my writing of commit messages.</p>\n<p>One bad habit one usualy takes as a solo developer or under time constraints is to ignore documentation. Missing documentation is not important until it is, then, it is really important.</p>\n<p>That’s one area I’m trying to improve in. Good commit messages are a most often ignored form of documentation, so how do we improve them? I have been reading <a href=\"https://chris.beams.io/posts/git-commit/\">how to write a good commit message</a>, it makes sense and it’s easy to follow and got me where I wanted as far as commit messages matter.</p>\n<p>However I became aware about <a href=\"https://www.conventionalcommits.org/en/v1.0.0-beta.3/\">Conventional Commits</a> thanks to <a href=\"https://dev.to/maxpou/enhance-your-git-log-with-conventional-commits-3ea4\">Enhance your git log with conventional commits</a>. I really liked the article and started writting conventional commits by hand for the last couple of days.</p>\n<p>I wanted to automate the enforcing of commit messages automatically in all my projects. I googled and found the tools I needed to set it up globally for all commit messages:</p>\n<ul>\n<li><a href=\"https://github.com/commitizen/cz-cli\">Commitizen</a> helps writing the conventional commit message</li>\n<li><a href=\"https://github.com/conventional-changelog/commitlint\">Commitlint</a> check each commit for proper format</li>\n<li><a href=\"https://til.hashrocket.com/posts/c89a35a66c-global-git-hooks\">Git global hooks</a> fail if the commit message is not properly formatted</li>\n</ul>\n<h3>Commitizen</h3>\n<p><a href=\"https://github.com/commitizen/cz-cli\">Commitizen</a> is a handy script that prompts and builds the parts of a conventional commit message.</p>\n<p>The first step is to install it: (taken from their README)</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">npm install -g commitizen</code></pre></div>\n<p>Install your prefered commitizen adapter globally, for example <code class=\"language-text\">cz-conventional-changelog</code></p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">npm install -g cz-commitizen-changelog</code></pre></div>","frontmatter":{"title":"Automating conventional commit messages globally","date":"March 17, 2019"}}},"pageContext":{"slug":"/automating-conventional-commit-messages-globally/","previous":{"fields":{"slug":"/update-redux-form-fields-using-bindactioncreators/"},"frontmatter":{"title":"Updating redux-form fields using bindActionCreators"}},"next":null}}